
"""
Сформувати функцію, що визначатиме чи є задане натуральне число простим.
(Простим називається число, що більше за 1 та не має інших дільників, окрім 1 та самого себе).

Виконав Іваненко Андрій Вадимович
"""


""" У даному випадку для визначення функції доцільніше використати ітерації ніж рекурсію, оскільки функція визначена 
через рекурсію витрачає більше часу та займає більше пам'яті за функцію визначену через ітерації. Також, якщо задане
число занадто велике, то при виклику функції визначеної через рекурсію може виникнути помилка RecursionError через те, 
що глибина рекурсії виходить за ліміт. """


def is_prime_number1(num):  # Функція для перевірки заданого числа на те, чи є воно простим (через ітерації)
    prime = True  # prime - змінна, яка має значення True, якщо задане число є простим
    for i in range(2, num):  # Проходження всіх чисел від 2 до числа, що передує заданому
        if num % i == 0:  # Якщо задане число ділиться на одне з цих чисел, то змінна prime стає дорівнювати False
            prime = False
    if prime:
        print(f"Число {num} є простим.")
    else:
        print(f"Число {num} не є простим.")



def is_prime_number2(number):  # Функція для перевірки заданого числа на те, чи є воно простим (через рекурсію)

    def is_prime_number(num, divider):
        # Якщо друге число дорівнює одиниці, то перевірка припиняється, а задане число визначається як просте
        if divider == 1:
            print(f"Число {num} є простим.")
            return
        # Якщо перше число ділиться на друге, то перевірка припиняється, а задане число визначається як не просте
        elif num % divider == 0:
            print(f"Число {num} не є простим.")
            return
        else:  # В іншому випадку перевірка продовжується, і при цьому друге число зменшується на одиницю
            return is_prime_number(num, divider - 1)

    """ Функція is_prime_number2, яка приймає в себе тільки одне значення, посилається на внутрішню функцію
    is_prime_number, яка вже приймає два числа, в якій у якості першого аргументу встановлено задане число,
    а в якості другого - число, що передує заданому. """
    is_prime_number(number, number - 1)


answer = '1'
while answer == '1':

    while True:  # Введення натурального числа n, над яким буде проводитись перевірка на те, чи є воно простим
        try:
            n = int(input("Введіть натуральне число:"))
            if n > 0:
                break
            else:
                print("Вводьте правильні дані!")
        except ValueError:
            print("Вводьте правильні дані!")

    print("(Визначено через ітерації):")
    is_prime_number1(n)
    print("(Визначено через рекурсію):")
    is_prime_number2(n)

    answer = input("Введіть '1' для повторення:")
